app/controllers/admin/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @admin_categories = Category.all

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Categoria nova"], ["description", "é uma nova categoria"], ["created_at", "2024-05-13 18:31:44.701862"], ["updated_at", "2024-05-13 18:31:44.701862"]]
---
  def create
    @admin_category = Category.new(admin_category_params)

    respond_to do |format|
      if @admin_category.save

UPDATE "categories" SET "updated_at" = ? WHERE "categories"."id" = ?  [["updated_at", "2024-05-25 22:32:24.136048"], ["id", 12]]
---
  def update
    respond_to do |format|
      if @admin_category.update(admin_category_params)

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]
---
  def destroy
    @admin_category.destroy!

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def set_admin_category
    @admin_category = Category.find(params[:id])