app/controllers/admin/products_controller.rb

  def index
    @admin_products = Product.all
---
SELECT "products".* FROM "products"

  def create
    @admin_product = Product.new(admin_product_params)

    respond_to do |format|
      if @admin_product.save
---
INSERT INTO "products" ("name", "description", "price", "category_id", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @admin_product.update(admin_product_params)
---
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 10002], ["updated_at", "2024-06-01 15:41:44.130574"], ["id", 1]]

  def set_admin_product
    @admin_product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]