app/views/admin/products/_form.html.erb

    <%= form.label :category_id %>
    <%= form.collection_select(:category_id, Category.all, :id, :description) %>
---
SELECT "categories".* FROM "categories"